app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `articles`.`title` = '77 ffdsfds', `articles`.`updated_at` = '2019-12-28 09:04:39.531580' WHERE `articles`.`id` = 1