app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
  def subscribe
    @articles = Article.all