app/controllers/comments_controller.rb

  def destroy
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 2 AND `comments`.`id` = 2 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 2